app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Pascalin"], ["email", "pascaline@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-03-23 11:34:30.487989"], ["updated_at", "2023-03-23 11:34:30.487989"]]
---
    def register
        user = User.create(user_params)

SELECT "users".* FROM "users" WHERE (username = 'Donald' OR email = 'donald@gmail.com') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def login
        sql = "username = :username OR email = :email"
        user = User.where(sql, { username: user_params[:username], email: user_params[:email] }).first